PayPalAPISoapBinding.CreateRecurringPaymentsProfile.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:ns2="urn:ebay:apis:CoreComponentTypes"
    xmlns:ns4="urn:ebay:apis:EnhancedDataTypes"
    xmlns:ns3="urn:ebay:apis:eBLBaseComponents"
    xmlns:ns1="urn:ebay:api:PayPalAPI">
 <SOAP-ENV:Header>
  <ns1:RequesterCredentials>
   <ns3:eBayAuthToken></ns3:eBayAuthToken>
   <ns3:HardExpirationWarning></ns3:HardExpirationWarning>
   <ns3:Credentials>
    <ns3:AppId></ns3:AppId>
    <ns3:DevId></ns3:DevId>
    <ns3:AuthCert></ns3:AuthCert>
    <ns3:Username></ns3:Username>
    <ns3:Password></ns3:Password>
    <ns3:Signature></ns3:Signature>
    <ns3:Subject></ns3:Subject>
    <ns3:AuthToken></ns3:AuthToken>
   </ns3:Credentials>
  </ns1:RequesterCredentials>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <ns1:CreateRecurringPaymentsProfileReq>
    <ns1:CreateRecurringPaymentsProfileRequest>
     <ns3:CreateRecurringPaymentsProfileRequestDetails>
      <ns3:Token></ns3:Token>
      <ns3:CreditCard>
       <ns3:CreditCardType>Visa</ns3:CreditCardType>
       <ns3:CreditCardNumber></ns3:CreditCardNumber>
       <ns3:ExpMonth>0</ns3:ExpMonth>
       <ns3:ExpYear>0</ns3:ExpYear>
       <ns3:CardOwner>
       </ns3:CardOwner>
       <ns3:CVV2></ns3:CVV2>
       <ns3:StartMonth>0</ns3:StartMonth>
       <ns3:StartYear>0</ns3:StartYear>
       <ns3:IssueNumber></ns3:IssueNumber>
       <ns3:ThreeDSecureRequest>
       </ns3:ThreeDSecureRequest>
      </ns3:CreditCard>
      <ns3:RecurringPaymentsProfileDetails>
       <ns3:SubscriberName></ns3:SubscriberName>
       <ns3:SubscriberShippingAddress>
       </ns3:SubscriberShippingAddress>
       <ns3:BillingStartDate>2017-10-31T23:22:28Z</ns3:BillingStartDate>
       <ns3:ProfileReference></ns3:ProfileReference>
      </ns3:RecurringPaymentsProfileDetails>
      <ns3:ScheduleDetails>
       <ns3:Description></ns3:Description>
       <ns3:TrialPeriod>
        <ns3:BillingPeriod>NoBillingPeriodType</ns3:BillingPeriod>
        <ns3:BillingFrequency>0</ns3:BillingFrequency>
       </ns3:TrialPeriod>
       <ns3:PaymentPeriod>
        <ns3:BillingPeriod>NoBillingPeriodType</ns3:BillingPeriod>
        <ns3:BillingFrequency>0</ns3:BillingFrequency>
       </ns3:PaymentPeriod>
       <ns3:MaxFailedPayments>0</ns3:MaxFailedPayments>
       <ns3:ActivationDetails>
       </ns3:ActivationDetails>
       <ns3:AutoBillOutstandingAmount>NoAutoBill</ns3:AutoBillOutstandingAmount>
      </ns3:ScheduleDetails>
      <ns3:PaymentDetailsItem>
       <ns3:Name></ns3:Name>
       <ns3:Number></ns3:Number>
       <ns3:Quantity>0</ns3:Quantity>
       <ns3:Tax currencyID="AFA"></ns3:Tax>
       <ns3:Amount currencyID="AFA"></ns3:Amount>
       <ns3:EbayItemPaymentDetailsItem>
       </ns3:EbayItemPaymentDetailsItem>
       <ns3:PromoCode></ns3:PromoCode>
       <ns3:ProductCategory>Other</ns3:ProductCategory>
       <ns3:Description></ns3:Description>
       <ns3:ItemWeight unit="">0.0</ns3:ItemWeight>
       <ns3:ItemLength unit="">0.0</ns3:ItemLength>
       <ns3:ItemWidth unit="">0.0</ns3:ItemWidth>
       <ns3:ItemHeight unit="">0.0</ns3:ItemHeight>
       <ns3:ItemURL></ns3:ItemURL>
       <ns3:EnhancedItemData>
       </ns3:EnhancedItemData>
       <ns3:ItemCategory>Physical</ns3:ItemCategory>
      </ns3:PaymentDetailsItem>
      <ns3:PaymentDetailsItem>
       <ns3:Name></ns3:Name>
       <ns3:Number></ns3:Number>
       <ns3:Quantity>0</ns3:Quantity>
       <ns3:Tax currencyID="AFA"></ns3:Tax>
       <ns3:Amount currencyID="AFA"></ns3:Amount>
       <ns3:EbayItemPaymentDetailsItem>
       </ns3:EbayItemPaymentDetailsItem>
       <ns3:PromoCode></ns3:PromoCode>
       <ns3:ProductCategory>Other</ns3:ProductCategory>
       <ns3:Description></ns3:Description>
       <ns3:ItemWeight unit="">0.0</ns3:ItemWeight>
       <ns3:ItemLength unit="">0.0</ns3:ItemLength>
       <ns3:ItemWidth unit="">0.0</ns3:ItemWidth>
       <ns3:ItemHeight unit="">0.0</ns3:ItemHeight>
       <ns3:ItemURL></ns3:ItemURL>
       <ns3:EnhancedItemData>
       </ns3:EnhancedItemData>
       <ns3:ItemCategory>Physical</ns3:ItemCategory>
      </ns3:PaymentDetailsItem>
      <ns3:SoftDescriptor></ns3:SoftDescriptor>
      <ns3:SoftDescriptorCity></ns3:SoftDescriptorCity>
     </ns3:CreateRecurringPaymentsProfileRequestDetails>
     <ns1:DetailLevel>ReturnAll</ns1:DetailLevel>
     <ns1:DetailLevel>ReturnAll</ns1:DetailLevel>
     <ns1:ErrorLanguage></ns1:ErrorLanguage>
     <ns1:Version></ns1:Version>
     <!-- extensibility element(s) -->
    </ns1:CreateRecurringPaymentsProfileRequest>
   </ns1:CreateRecurringPaymentsProfileReq>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
